01  WS-DATA-AREA. 
    05 WS-AMOUNT          PIC 9(5)V99. 
    05 WS-QTY             PIC 9(3). 
*...
    ADD WS-AMOUNT WS-AMOUNT TO WS-TOTAL-AMOUNT. 
    COMPUTE WS-AVERAGE-AMOUNT = WS-TOTAL-AMOUNT / WS-QTY. 